rtkconnectivity/zephyr/soc/arm/realtek_bee/rtl87x2g/ota_src/ble_dfu_transport.c
/**
*****************************************************************************************
*     Copyright(c) 2023, Realtek Semiconductor Corporation. All rights reserved.
*****************************************************************************************
   * @file      ble_dfu_transport.c
   * @brief     Source file for using ble dfu transport
   * @author    Grace
   * @date      2023-12-06
   * @version   v1.1
   **************************************************************************************
   * @attention
   * <h2><center>&copy; COPYRIGHT 2023 Realtek Semiconductor Corporation</center></h2>
   **************************************************************************************
  */

/*============================================================================*
 *                              Header Files
 *============================================================================*/

#include <string.h>
#include <stdlib.h>
#include "ble_dfu_transport.h"
#include "rtk_dfu_service.h"
#include "dfu_common.h"
#include "os_mem.h"
#include "os_sync.h"
#include "os_timer.h"
#include "fmc_api.h"
#include "fmc_platform.h"
#include "trace.h"
#if (SUPPORT_NORMAL_OTA == 1)
#include "dfu_main.h"
#endif
#include "rtl876x_lib_platform.h"
#include "patch_header_check.h"

#include <zephyr/bluetooth/bluetooth.h>
#include <zephyr/bluetooth/hci.h>
#include <zephyr/bluetooth/conn.h>
#include <zephyr/bluetooth/uuid.h>
#include <zephyr/bluetooth/gatt.h>

#include <rtk_ota_app_layer.h>

#include <zephyr/logging/log.h>
LOG_MODULE_REGISTER(ble_dfu_transport);

/*if enable transfer encrypted air data packet by aes. disable: 0*/
#define ENABLE_OTA_AES                  1

/*============================================================================*
 *                              Variables
 *============================================================================*/
static OTA_FUNCTION_STRUCT ota_struct;
static uint8_t temp_image_total_num = 0;

bool dfu_active_reset_pending = false;
bool dfu_active_reset_to_ota_mode = false;
bool dfu_switch_to_ota_mode_pending = false;


/*============================================================================*
 *                              Private Functions
 *============================================================================*/
/**
    * @brief    get current active bank
    * @param    void
    * @return   0x01:bank0, 0x02:bank1, 0x00:not support bank switch
    */
static uint8_t ble_ota_service_get_active_bank(void)
{
    uint8_t active_bank;
    uint32_t ota_bank0_addr;

    if (is_ota_support_bank_switch())
    {
        ota_bank0_addr = flash_partition_addr_get(PARTITION_FLASH_OTA_BANK_0);

        if (ota_bank0_addr == get_active_ota_bank_addr())
        {
            active_bank = IMAGE_LOCATION_BANK0;
        }
        else
        {
            active_bank = IMAGE_LOCATION_BANK1;
        }
    }
    else
    {
        active_bank = NOT_SUPPORT_BANK_SWITCH;
    }

    return active_bank;
}

static uint8_t ble_ota_service_get_bootpatch_active_bank(void)
{
    uint8_t active_bank;
    uint32_t boot_patch0_addr;

    boot_patch0_addr = flash_partition_addr_get(PARTITION_FLASH_BOOT_PATCH0);

    if (boot_patch0_addr == get_header_addr_by_img_id(IMG_BOOTPATCH))
    {
        active_bank = IMAGE_LOCATION_BANK0;
    }
    else
    {
        active_bank = IMAGE_LOCATION_BANK1;
    }

    return active_bank;
}

static uint8_t ble_ota_service_get_secureapp_active_bank(void)
{
    uint8_t active_bank;
    uint32_t secure_app0_addr;

    if (is_ota_support_bank_switch())
    {
        secure_app0_addr = flash_partition_addr_get(PARTITION_FLASH_SECURE_APP0);

        if (secure_app0_addr == get_header_addr_by_img_id(IMG_SECUREMCUAPP))
        {
            active_bank = IMAGE_LOCATION_BANK0;
        }
        else
        {
            active_bank = IMAGE_LOCATION_BANK1;
        }
    }
    else
    {
        active_bank = NOT_SUPPORT_BANK_SWITCH;
    }

    return active_bank;
}


/**
    * @brief    Wrapper function to send notification to peer
    * @note
    * @param    conn     ID to identify the connection
    * @param    opcode      Notification on the specified opcode
    * @param    len         Notification data length
    * @param    data        Additional notification data
    * @return   void
    */
static void ble_dfu_service_prepare_send_notify(struct bt_conn *conn, uint8_t opcode, uint16_t len,
                                                uint8_t *data)
{
    uint8_t *p_buffer = NULL;
    uint16_t mtu_size;
    uint16_t remain_size = len;
    uint8_t *p_data = data;
    uint16_t send_len;

    if ((data == NULL) || (len == 0))
    {
        return;
    }

    //le_get_conn_param(GAP_PARAM_CONN_MTU_SIZE, &mtu_size, conn);
    mtu_size = bt_gatt_get_mtu(conn);

    LOG_INF("mtu_size:%d",mtu_size);

    p_buffer = malloc(mtu_size);

    if (p_buffer == NULL)
    {
        return;
    }

    if (len < mtu_size - 2)
    {
        p_buffer[0] = DFU_OPCODE_NOTIF;
        p_buffer[1] = opcode;
        memcpy(&p_buffer[2], data, len);

        dfu_service_send_notification(conn, p_buffer, len + 2);

        free(p_buffer);

        return;
    }

    while (remain_size)
    {
        if (remain_size == len)
        {
            p_buffer[0] = DFU_OPCODE_NOTIF;
            p_buffer[1] = opcode;
            memcpy(&p_buffer[2], p_data, mtu_size - 2);
            dfu_service_send_notification(conn, p_buffer, mtu_size);

            p_data += (mtu_size - 2);
            remain_size -= (mtu_size - 2);
            continue;
        }

        send_len = (remain_size > mtu_size) ? mtu_size : remain_size;
        memcpy(p_buffer, p_data, send_len);
        dfu_service_send_notification(conn, p_buffer, send_len);

        p_data += send_len;
        remain_size -= send_len;
    }

    free(p_buffer);
}

/**
    * @brief    check section size before ota
    * @param    void
    * @return   true: check success; false: check fail
    */
static bool dfu_check_section_size(void)
{
    uint32_t section_size = dfu_get_temp_ota_bank_img_size_by_img_id((IMG_ID)ota_struct.image_id);

