rtkconnectivity/zephyr/soc/arm/realtek_bee/rtl87x2g/ota_src/ble_dfu_transport.c
    if (ota_struct.image_total_length > section_size)
    {
        LOG_ERR("dfu_check_section_size: total size 0x%x, section size 0x%x",
                         ota_struct.image_total_length, section_size);
        return false;
    }

    return true;
}

/**
    * @brief  Reset local variables
    * @return void
    */
static void ble_dfu_clear_local(T_OTA_CLEAR_LOCAL_CAUSE cause)
{
    APP_PRINT_TRACE1("app_ota_clear_local cause: %d", cause);
    temp_image_total_num = 0;
    ota_struct.image_total_length = 0;
    ota_struct.image_id = 0;
    ota_struct.cur_offset = 0;
    ota_struct.next_subimage_offset = 0;
    ota_struct.ota_flag.value = 0;
    ota_struct.ota_temp_buf_used_size = 0;
    if (cause)
    {
        ota_struct.test.value = 0;
    }

    memset(ota_struct.bd_addr, 0, sizeof(ota_struct.bd_addr));
    if (ota_struct.force_temp_mode)
    {
        //force_enable_ota_temp(false);
        ota_struct.force_temp_mode = 0;
    }

    if (ota_struct.p_ota_temp_buf_head != NULL)
    {
        free(ota_struct.p_ota_temp_buf_head);
        ota_struct.p_ota_temp_buf_head = NULL;
        ota_struct.buffer_size = 0;
    }

    if (ota_struct.bp_level)
    {
        uint32_t s;
        s = os_lock();
        fmc_flash_nor_set_bp_lv(FMC_MAIN0_ADDR, ota_struct.bp_level);
        os_unlock(s);
        ota_struct.bp_level = 0;
    }
}

/**
    * @brief  timeout callback for ota
    * @param  timer_id  timer id
    * @param  timer_chann  time channel
    * @return void
    */
static void ble_dfu_timeout_cb(void *p_xtimer)
{
    uint32_t timer_id = 0;

    os_timer_id_get(&p_xtimer, &timer_id);
    LOG_INF("ble_dfu_timeout_cb: timer id 0x%02X", timer_id);

    switch (timer_id)
    {
    case TIMER_ID_DFU_IMAGE_TRANS:
        {
            os_timer_stop(&ota_struct.timer_handle_ota_transfer);
            ble_dfu_clear_local(OTA_IMAGE_TRANS_TIMEOUT);
        }
        break;
    default:
        break;
    }
}

static bool dfu_get_enc_setting(void)
{
    if (ENABLE_OTA_AES)
    {
        return true;
    }
    else
    {
        return false;
    }

}

/**
    * @brief    Handle the start dfu control point
    * @param    p_data     data to be written
    * @return   handle result 0x01:success other:fail
    */
static uint8_t ble_dfu_cp_start_dfu_handle(uint8_t *p_data) //0x01
{
    uint8_t results = DFU_ARV_SUCCESS;

    if (p_data == NULL)
    {
        results = DFU_ARV_FAIL_INVALID_PARAMETER;
        return results;
    }

    if (dfu_get_enc_setting())
    {
        //LOG_INF("start dfu before decrypted: %b", TRACE_BINARY(16, p_data));
        LOG_HEXDUMP_INF(p_data, 16, "start dfu before decrypted:");
        dfu_aes256_decrypt_16byte(p_data);
        //LOG_INF("start dfu after decrypted: %b", TRACE_BINARY(16, p_data));
        LOG_HEXDUMP_INF(p_data, 16, "start dfu after decrypted:");
    }

    T_IMG_CTRL_HEADER_FORMAT *start_dfu_para = (T_IMG_CTRL_HEADER_FORMAT *)p_data;
    ota_struct.force_temp_mode = *(uint8_t *)((T_IMG_CTRL_HEADER_FORMAT *)p_data + 1);
    ota_struct.image_total_length = start_dfu_para->payload_len + DEFAULT_HEADER_SIZE;
    ota_struct.image_id = start_dfu_para->image_id;
    LOG_INF("ble_dfu_cp_start_dfu_handle: force_temp_mode=0x%x", ota_struct.force_temp_mode);
    /* zephyr build not work ,todo */
    LOG_INF("ble_dfu_cp_start_dfu_handle: ic_type=0x%x, CtrlFlag=0x%x, img_id=0x%x ,CRC16=0x%x, Total Length=0x%x",
                     start_dfu_para->ic_type,
                     start_dfu_para->ctrl_flag.value,
                     start_dfu_para->image_id,
                     start_dfu_para->crc16,
                     ota_struct.image_total_length
                    );

    if (dfu_check_section_size() == false)
    {
        LOG_INF("ble_dfu_cp_start_dfu_handle: Image is oversize");
        results = DFU_ARV_FAIL_INVALID_PARAMETER;
        return results;
    }

    if (ota_struct.force_temp_mode)
    {
        //force_enable_ota_temp(true);
    }

    if ((!is_ota_support_bank_switch() && ota_struct.image_id == IMG_OTA)
        || ota_struct.image_id < IMG_DFU_FIRST
        || ((ota_struct.image_id >= IMG_DFU_MAX) &&
            (ota_struct.image_id < IMG_USER_DATA_FIRST)))
    {
        results = DFU_ARV_FAIL_INVALID_PARAMETER;
        return results;
    }

#if (SUPPORT_BL_COPY_SECURE_IMAGE == 1)
    if (is_ota_support_bank_switch())
    {
        if ((ota_struct.image_id >= IMG_BANK_FIRST && ota_struct.image_id < IMG_DFU_MAX) ||
            ota_struct.image_id == IMG_OTA)
        {
            /*only the images located in OTA Bank need set to 0 when dual bank*/
            ota_struct.next_subimage_offset = 0;
        }
        else
        {
            /*restore next image offset*/
            ota_struct.next_subimage_offset = ota_struct.tmp_next_subimage_offset;
        }
    }
#else
    if (is_ota_support_bank_switch())
    {
        ota_struct.next_subimage_offset = 0;
    }
    else
    {
        if (ota_struct.image_id == IMG_BOOTPATCH ||
            (ota_struct.image_id >= IMG_USER_DATA_FIRST && ota_struct.image_id < IMG_USER_DATA_MAX))
        {
            /*bootpatch always dual bank*/
            ota_struct.next_subimage_offset = 0;
        }
        else
        {
            /*restore next image offset*/
            ota_struct.next_subimage_offset = ota_struct.tmp_next_subimage_offset;
        }
    }
#endif

    ota_struct.ota_flag.is_ota_process = true;
    ota_struct.ota_temp_buf_used_size = 0;
    ota_struct.cur_offset = 0;
#if (SUPPORT_NORMAL_OTA == 1)
    if (is_normal_ota_mode)
    {
        uint32_t restart_ms = (ota_struct.image_total_length + 0x19000 - 1) / 0x19000 *
                              NORMAL_OTA_TIMEOUT_TOTAL * 1000;
        os_timer_restart(&normal_ota_total_timer_handle, restart_ms);
        LOG_INF("ble_dfu_cp_start_dfu_handle: restart total timer %d ms", restart_ms);
    }
#endif

    uint32_t s;
    s = os_lock();
    fmc_flash_nor_set_bp_lv(FMC_MAIN0_ADDR, 0);
    os_unlock(s);

    return results;
}

/**
    * @brief    Valid the image
    * @param    p_date     point of input data
    * @return   valid result
    */
static uint8_t ble_dfu_cp_valid_handle(uint8_t *p_data) //0x03
{
    uint8_t results = DFU_ARV_SUCCESS;
    uint16_t image_id;

    if (!ota_struct.ota_flag.skip_flag
        && ota_struct.test.t_skip_fail)
    {
        ota_struct.test.t_skip_fail = 0;
        results = DFU_ARV_FAIL_CRC_ERROR;
        return results;
    }

    ota_struct.ota_flag.skip_flag = 0;

    if (p_data == NULL)
    {
        results = DFU_ARV_FAIL_INVALID_PARAMETER;
        return results;
    }

