rtkconnectivity/zephyr/soc/arm/realtek_bee/rtl87x2g/ota_src/ble_dfu_transport.c
    LE_ARRAY_TO_UINT16(image_id, p_data);
    LE_ARRAY_TO_UINT8(ota_struct.is_last_image, p_data + 2);
    LOG_INF("==>ble_dfu_cp_valid_handle: img_id=0x%x, ota_struct.image_id=0x%x, is_last_image=%d",
                     image_id, ota_struct.image_id, ota_struct.is_last_image);

    if (image_id == ota_struct.image_id)
    {
        if (!dfu_checksum((IMG_ID)image_id, ota_struct.next_subimage_offset))
        {
            results = DFU_ARV_FAIL_CRC_ERROR;
        }
        else
        {
            //user data image needn't record into temp info
            if (ota_struct.image_id >= IMG_DFU_FIRST && ota_struct.image_id < IMG_DFU_MAX)
            {
                bool bank_switch = is_ota_support_bank_switch();
#if (SUPPORT_BL_COPY_SECURE_IMAGE == 1)
                bool is_ota_bank_image = (ota_struct.image_id == IMG_OTA) ||
                                         (ota_struct.image_id >= IMG_BANK_FIRST && ota_struct.image_id < IMG_DFU_MAX);
                if ((bank_switch && !is_ota_bank_image)
                    || !bank_switch)
#else
                if (!bank_switch && ota_struct.image_id != IMG_BOOTPATCH)
#endif
                {
                    ota_struct.tmp_next_subimage_offset += ota_struct.cur_offset;
                    ota_struct.next_subimage_offset = ota_struct.tmp_next_subimage_offset;

                    ota_struct.temp_image_info[temp_image_total_num].image_offset =
                        ota_struct.next_subimage_offset - ota_struct.image_total_length;

                    LOG_INF("==>ble_dfu_cp_valid_handle:temp info idx %d,  image_id 0x%x, image_offset 0x%x in temp bank",
                                     temp_image_total_num, ota_struct.image_id,
                                     ota_struct.temp_image_info[temp_image_total_num].image_offset);
                    temp_image_total_num ++;
                }

                ota_struct.cur_offset = 0;
                /* set updated images valid */
                SET_VALID_BITMAP(image_id);

                LOG_INF("==>ble_dfu_cp_valid_handle: valid_bitmap= 0x%x", valid_bitmap);
            }

            if (ota_struct.image_id >= IMG_USER_DATA_FIRST && ota_struct.image_id < IMG_USER_DATA_MAX)
            {
                SET_USER_DATA_VALID_BITMAP(image_id);
            }

            LOG_INF("==>ble_dfu_cp_valid_handle: checksum Success! temp bank next_subimage_offset= 0x%x",
                             ota_struct.next_subimage_offset);
        }
    }
    else
    {
        results = DFU_ARV_FAIL_INVALID_PARAMETER;
    }

    return results;
}

static void ble_dfu_bootpatch_always_bank_switch(void)
{
    if (ota_struct.test.t_stress_test && GET_VALID_BITMAP(IMG_BOOTPATCH))
    {
        LOG_INF("<==ble_dfu_bootpatch_always_bank_switch");
        uint32_t image_addr = get_header_addr_by_img_id(IMG_BOOTPATCH);
        fmc_flash_nor_erase(image_addr, FMC_FLASH_NOR_ERASE_SECTOR);
    }
}

static void  dfu_set_ota_temp_image_ready(void)
{
    uint32_t base_addr = 0;
    T_IMG_HEADER_FORMAT *p_header = NULL;
    base_addr = flash_partition_addr_get(PARTITION_FLASH_OTA_TMP);

    LOG_INF("<==dfu_set_ota_temp_image_ready: ota_temp_addr =0x%x, temp_image_total_num %d",
                    base_addr, temp_image_total_num);

    for (int i = temp_image_total_num - 1; i >= 0; i--)
    {
        p_header = (T_IMG_HEADER_FORMAT *)(base_addr + ota_struct.temp_image_info[i].image_offset);
        if (p_header)
        {
            dfu_set_ready(p_header);
        }
    }
}

static void ble_dfu_cp_active_reset_handle(struct bt_conn *conn, bool is_enter_dfu_mode)
{
    T_IMG_HEADER_FORMAT *p_header = NULL;
    uint16_t img_id = IMG_DFU_MAX;

    if (!is_ota_support_bank_switch())
    {
        dfu_set_ota_temp_image_ready();

#if (SUPPORT_BL_COPY_SECURE_IMAGE == 0)
        img_id = IMG_BOOTPATCH;
        if (GET_VALID_BITMAP(img_id))
        {
            p_header = (T_IMG_HEADER_FORMAT *)dfu_get_temp_ota_bank_img_addr_by_img_id((IMG_ID)img_id);
            if (p_header)
            {
                dfu_set_ready(p_header);
            }
        }
#endif
    }
    else
    {
#if (SUPPORT_BL_COPY_SECURE_IMAGE == 1)
        /* support bank switch */
        img_id = IMG_DFU_MAX - 1;

        for (; img_id >= IMG_BANK_FIRST; img_id--)
        {
            if (GET_VALID_BITMAP(img_id))
            {
                p_header = (T_IMG_HEADER_FORMAT *)dfu_get_temp_ota_bank_img_addr_by_img_id((IMG_ID)img_id);
                if (p_header)
                {
                    dfu_set_ready(p_header);
                }
            }
        }

        img_id = IMG_OTA;
        if (GET_VALID_BITMAP(img_id))
        {
            p_header = (T_IMG_HEADER_FORMAT *)dfu_get_temp_ota_bank_img_addr_by_img_id((IMG_ID)img_id);
            if (p_header)
            {
                dfu_set_ready(p_header);
            }
        }

        dfu_set_ota_temp_image_ready();
#else
        /* support bank switch */
        img_id = IMG_DFU_MAX - 1;

        /*include boot patch and secure app or data*/
        for (; img_id >= IMG_DFU_FIRST; img_id--)
        {
            if (GET_VALID_BITMAP(img_id))
            {
                p_header = (T_IMG_HEADER_FORMAT *)dfu_get_temp_ota_bank_img_addr_by_img_id((IMG_ID)img_id);
                if (p_header)
                {
                    dfu_set_ready(p_header);
                }
            }
        }
#endif
    }

    /*set user data image ready*/
    img_id = IMG_USER_DATA_FIRST;
    for (; img_id < IMG_USER_DATA_MAX; img_id++)
    {
        if (GET_USER_DATA_VALID_BITMAP(img_id))
        {
            p_header = (T_IMG_HEADER_FORMAT *)dfu_get_temp_ota_bank_img_addr_by_img_id((IMG_ID)img_id);
            if (p_header)
            {
                dfu_set_ready(p_header);
            }
        }
    }

#if (SUPPORT_NORMAL_OTA == 1)
    LOG_INF("==>ble_dfu_cp_active_reset_handle: is_enter_dfu_mode=%d, is_normal_ota_mode=%d",
                    is_enter_dfu_mode, is_normal_ota_mode);
    if (is_enter_dfu_mode && is_normal_ota_mode)
    {
        //need reset to ota mode
        dfu_active_reset_to_ota_mode = true;
    }
#endif

    ble_dfu_bootpatch_always_bank_switch();

