rtkconnectivity/zephyr/soc/arm/realtek_bee/rtl87x2g/ota_src/ble_dfu_transport.c
    //le_disconnect(conn);
    bt_conn_disconnect(conn, BT_HCI_ERR_REMOTE_USER_TERM_CONN);

    dfu_active_reset_pending = true;

    ble_dfu_clear_local(OTA_SUCCESS_REBOOT);

}

/**
    * @brief    get image info for ota
    * @param    *p_data   point of input data
    * @param    *data   point of output data
    * @return   void
    */
static void ble_dfu_cp_report_img_info_handle(uint8_t *p_data, uint8_t *p_notify_data) //0x06
{
    uint16_t image_id;
    uint32_t dfu_base_addr;
    uint32_t s;

    if ((p_notify_data == NULL) || (p_data == NULL))
    {
        return;
    }

    LE_ARRAY_TO_UINT16(image_id, p_data);
    LOG_INF("ble_dfu_cp_report_img_info_handle: received img_id 0x%x, ota_struct.image_id=0x%x",
                     image_id, ota_struct.image_id);

    if (image_id != ota_struct.image_id)
    {
        ota_struct.cur_offset = 0;
        ota_struct.ota_temp_buf_used_size = 0;
        ota_struct.image_id = image_id;
    }

    if (image_id < IMG_DFU_FIRST ||
        ((image_id >= IMG_DFU_MAX) && (image_id < IMG_USER_DATA_FIRST)))
    {
        LOG_ERR("ble_dfu_cp_report_img_info_handle: received img_id 0x%x invalid!", image_id);

        p_notify_data[0] = DFU_ARV_FAIL_INVALID_PARAMETER;
        return;
    }

    dfu_base_addr = dfu_get_temp_ota_bank_img_addr_by_img_id((IMG_ID)image_id);
    if ((dfu_base_addr % FLASH_SECTOR_SIZE) == 0)
    {
        ota_struct.buffer_check_offset = 0;
    }
    else
    {
        ota_struct.buffer_check_offset = dfu_base_addr % FLASH_SECTOR_SIZE;
        s = os_lock();
        fmc_flash_nor_read(dfu_base_addr - ota_struct.buffer_check_offset,
                           ota_struct.p_ota_temp_buf_head,
                           ota_struct.buffer_check_offset);
        os_unlock(s);
    }

    p_notify_data[0] = DFU_ARV_SUCCESS;
    LE_UINT32_TO_ARRAY(&p_notify_data[1], 0);
    LE_UINT32_TO_ARRAY(&p_notify_data[5], ota_struct.cur_offset);
    LE_UINT16_TO_ARRAY(&p_notify_data[9], ota_struct.buffer_check_offset);

    LOG_INF("ble_dfu_cp_report_img_info_handle: Notify cur_offset=0x%x, buffer_check_offset=0x%x",
                     ota_struct.cur_offset, ota_struct.buffer_check_offset);
}


static void ble_dfu_cp_conn_para_update_handle(struct bt_conn *conn, uint8_t *p_data, uint8_t *p_notify_data) //0x06
{
    uint16_t conn_interval_min;
    uint16_t conn_interval_max;
    uint16_t conn_latency;
    uint16_t superv_tout;

    if ((p_notify_data == NULL) || (p_data == NULL))
    {
        return;
    }

    p_notify_data[0] = DFU_ARV_SUCCESS;

    LE_ARRAY_TO_UINT16(conn_interval_min, p_data);
    LE_ARRAY_TO_UINT16(conn_interval_max, p_data + 2);
    LE_ARRAY_TO_UINT16(conn_latency, p_data + 4);
    LE_ARRAY_TO_UINT16(superv_tout, p_data + 6);
    LOG_INF("==>le_dfu_cp_conn_para_update_handle: conn_min=0x%x, conn_max=0x%x, latcy=0x%x, timeout=0x%x",
                    conn_interval_min, conn_interval_max, conn_latency, superv_tout);


    if (ota_struct.dfu_conn_para_update_in_progress)
    {
        p_notify_data[0] = DFU_ARV_FAIL_OPERATION;
        LOG_INF("==>le_dfu_cp_conn_para_update_handle: OTA ConnParaUpdInProgress!");
    }
    else
    {
        /* Change to zephyr host API. Note!!! Zephyr doesnot have min_ce_length & max_ce_length */
        struct bt_le_conn_param param;
        param.interval_max = conn_interval_max;
        param.interval_min = conn_interval_min;
        param.latency = conn_latency;
        param.timeout = superv_tout;

        if (bt_conn_le_param_update(conn, &param) == 0) {
            /* Connection Parameter Update Request sent successfully, means this procedure is in progress. */
            ota_struct.dfu_conn_para_update_in_progress = true;
            LOG_INF("==>le_dfu_cp_conn_para_update_handle: updating");
        } else {
            p_notify_data[0] = DFU_ARV_FAIL_OPERATION;
            return;
        }
    }
    LOG_INF("ble_dfu_cp_report_img_info_handle: cur_offset=0x%x, buffer_check_offset=0x%x",
                     ota_struct.cur_offset, ota_struct.buffer_check_offset);
}
/**
    * @brief    Handle buffer check enable cmd
    * @param    p_data      point of output data
    * @param    max_buffer_size     set max buffer size
    * @return   void
    */
static void ble_dfu_cp_buffer_check_en_handle(uint8_t *p_notify_data,
                                              uint16_t max_buffer_size)  //0x09
{
    uint8_t size_factor = 0;

    if (p_notify_data == NULL)
    {
        return;
    }

    ota_struct.ota_flag.buffer_check_en = true;

    while (ota_struct.p_ota_temp_buf_head == NULL)
    {
        ota_struct.buffer_size = max_buffer_size >> size_factor;
        ota_struct.p_ota_temp_buf_head = (uint8_t *)malloc(ota_struct.buffer_size);
        //ota_struct.p_ota_temp_buf_head = (uint8_t *)os_mem_alloc(0, ota_struct.buffer_size);
        size_factor ++;
        if (ota_struct.buffer_size <= 0)
        {
            break;
        }
    }

    if (ota_struct.p_ota_temp_buf_head == NULL
        || ota_struct.buffer_size == 0)
    {
        ota_struct.ota_flag.buffer_check_en = false;
    }
    p_notify_data[0] = ota_struct.ota_flag.buffer_check_en;
    LE_UINT16_TO_ARRAY(&p_notify_data[1], ota_struct.buffer_size);
    //LE_UINT16_TO_ARRAY(&p_notify_data[3], ota_struct.mtu_size);  //ota verion =4, is rsvd val

    LOG_INF("ble_dfu_cp_buffer_check_en: buffer_check_en=%d, buffer_size=%d",
                     ota_struct.ota_flag.buffer_check_en, ota_struct.buffer_size);
}

/**
    * @brief    Handle written request on DFU packet
    * @param    p_data     point of input data
    * @param    data      point of output data
    * @return   void
    */
static void ble_dfu_cp_buffer_check_handle(uint8_t *p_data, uint8_t *data)  //0x0a
{
    uint16_t data_size;
    uint16_t crc;

    T_DFU_CALLBACK_DATA callback_data;
    //callback_data.conn_id = conn_id;
    callback_data.msg_type = SERVICE_CALLBACK_TYPE_WRITE_CHAR_VALUE;
    callback_data.msg_data.write.write_attrib_index = INDEX_DFU_CHAR_DFU_CONTROL_POINT_INDEX;

    if ((p_data == NULL) || (ota_struct.ota_flag.is_ota_process == false))
    {
        ota_struct.ota_temp_buf_used_size = 0;
        data[0] = DFU_ARV_FAIL_OPERATION;
        LE_UINT32_TO_ARRAY(&data[1], ota_struct.cur_offset);
        return;
    }

    LE_ARRAY_TO_UINT16(data_size, p_data);
    LE_ARRAY_TO_UINT16(crc, p_data + 2);

    LOG_INF("===>ble_dfu_cp_buffer_check_handle: data_size=%d, crc=0x%x, ota_temp_buf_used_size=%d, buffer_check_offset=%d",
                     data_size, crc, ota_struct.ota_temp_buf_used_size, ota_struct.buffer_check_offset);

