rtkconnectivity/zephyr/soc/arm/realtek_bee/rtl87x2g/ota_src/ble_dfu_transport.c
    if (data_size != ota_struct.ota_temp_buf_used_size)
    {
        ota_struct.ota_temp_buf_used_size = 0;
        data[0] = DFU_ARV_FAIL_DATA_LENGTH_ERROR;
        LE_UINT32_TO_ARRAY(&data[1], ota_struct.cur_offset);
        return;
    }

    if (dfu_check_bufcrc(ota_struct.p_ota_temp_buf_head + ota_struct.buffer_check_offset,
                         ota_struct.ota_temp_buf_used_size, crc))
    {
        ota_struct.ota_temp_buf_used_size = 0;
        ota_struct.buffer_check_offset = 0;
        data[0] = DFU_ARV_FAIL_CRC_ERROR;
        LE_UINT32_TO_ARRAY(&data[1], ota_struct.cur_offset);
        LOG_INF("ble_dfu_cp_buffer_check_handle: buffer check fail!");
    }
    else
    {
        LOG_INF("ble_dfu_cp_buffer_check_handle: write flash, offset=0x%x", ota_struct.cur_offset);
        if (dfu_get_enc_setting())
        {
            uint16_t offset = 0;
            while ((ota_struct.ota_temp_buf_used_size - offset) >= 16)
            {
                dfu_aes256_decrypt_16byte(ota_struct.p_ota_temp_buf_head + offset);
                offset += 16;
            }
        }

        uint32_t flash_write_result = dfu_write_data_to_flash(ota_struct.image_id,
                                                              ota_struct.cur_offset,
                                                              ota_struct.next_subimage_offset,
                                                              ota_struct.ota_temp_buf_used_size + ota_struct.buffer_check_offset,
                                                              ota_struct.p_ota_temp_buf_head);

        LOG_INF("ble_dfu_cp_buffer_check_handle: write ret %d", flash_write_result);

        if (flash_write_result == 0)
        {
            uint32_t updated_success_len = ota_struct.ota_temp_buf_used_size;
            callback_data.msg_data.write.opcode = DFU_WRITE_DOING;
            callback_data.msg_data.write.length = 4;
            callback_data.msg_data.write.p_value = (uint8_t *)&updated_success_len;

            T_APP_RESULT cause = app_dfu_srv_cb((void *)&callback_data);

            if (cause != APP_RESULT_SUCCESS)
            {
                return;
            }
            
            ota_struct.cur_offset += ota_struct.ota_temp_buf_used_size;
            ota_struct.ota_temp_buf_used_size = 0;
            ota_struct.buffer_check_offset = 0;
            data[0] = DFU_ARV_SUCCESS;
            LE_UINT32_TO_ARRAY(&data[1], ota_struct.cur_offset);
        }
        else
        {
            uint32_t erase_time = 0;
            uint32_t resend_offset = (ota_struct.next_subimage_offset + ota_struct.cur_offset) /
                                     FLASH_SECTOR_SIZE * FLASH_SECTOR_SIZE;

            if (resend_offset < ota_struct.next_subimage_offset)
            {
                ota_struct.ota_temp_buf_used_size = 0;
                data[0] = DFU_ARV_FAIL_FLASH_ERASE_ERROR;
                LE_UINT32_TO_ARRAY(&data[1], ota_struct.cur_offset);
                return;
            }

            ota_struct.cur_offset = resend_offset - ota_struct.next_subimage_offset;
            LOG_INF("ble_dfu_cp_buffer_check_handle: write fail! cur_offset=0x%x, resend_offset=0x%x, next_subimage_offset=0x%x",
                             ota_struct.cur_offset, resend_offset, ota_struct.next_subimage_offset);

            while (erase_time < 3)
            {
                if (dfu_flash_erase((IMG_ID)ota_struct.image_id, resend_offset) == true)
                {
                    ota_struct.ota_temp_buf_used_size = 0;
                    data[0] = DFU_ARV_FAIL_FLASH_WRITE_ERROR;
                    LE_UINT32_TO_ARRAY(&data[1], ota_struct.cur_offset);
                    break;
                }
                else
                {
                    erase_time++;
                }
            }
            if (erase_time >= 3)
            {
                ota_struct.ota_temp_buf_used_size = 0;
                data[0] = DFU_ARV_FAIL_FLASH_ERASE_ERROR;
                LE_UINT32_TO_ARRAY(&data[1], ota_struct.cur_offset);
                LOG_INF("ble_dfu_cp_buffer_check_handle: erase fail more than three times!");

                T_DFU_FAIL_REASON dfu_fail_reason = DFU_FAIL_UPDATE_FLASH;
                callback_data.msg_data.write.opcode = DFU_WRITE_FAIL;
                callback_data.msg_data.write.length = sizeof(T_DFU_FAIL_REASON);
                callback_data.msg_data.write.p_value = (uint8_t *)&dfu_fail_reason;

                T_APP_RESULT cause = app_dfu_srv_cb((void *)&callback_data);
                
                if (cause != APP_RESULT_SUCCESS) {
                    return;
                }

            }
        }
    }
}

/**
    * @brief    copy image to the other bank
    * @param    p_data    point of input data
    * @return   1: success  other: fail
    */
static uint8_t ble_dfu_cp_copy_img_handle(uint8_t *p_data) //0x0c
{
    uint32_t source_base_addr;
    T_IMG_CTRL_HEADER_FORMAT ctrl_header;
    uint32_t offset = 0;
    uint8_t ret = DFU_ARV_SUCCESS;
    uint16_t img_id;
    uint8_t *buffer_addr = ota_struct.p_ota_temp_buf_head;
    uint32_t buffer_size = MAX_BUFFER_SIZE;
    uint8_t *p_copy_buffer = NULL;
    uint8_t bp_lv;
    uint8_t size_factor = 0;
    uint32_t s;

    ota_struct.ota_flag.skip_flag = 1;

    if (ota_struct.test.t_copy_fail)
    {
        ota_struct.test.t_copy_fail = 0;
        ret = DFU_ARV_FAIL_OPERATION;
        return ret;
    }

    if (p_data == NULL)
    {
        ret = DFU_ARV_FAIL_OPERATION;
        return ret;
    }

    LE_ARRAY_TO_UINT16(img_id, p_data);

    if ((img_id < IMG_MCUAPPDATA1) || (img_id >= IMG_DFU_MAX))
    {
        ret = DFU_ARV_FAIL_INVALID_PARAMETER;
        return ret;
    }

    source_base_addr = get_header_addr_by_img_id((IMG_ID)img_id);

    if ((source_base_addr % FLASH_SECTOR_SIZE) || (source_base_addr == 0))
    {
        ret = DFU_ARV_FAIL_OPERATION;
        return ret;
    }

    T_IMG_HEADER_FORMAT *p_data_header = (T_IMG_HEADER_FORMAT *)source_base_addr;
    s = os_lock();
    fmc_flash_nor_read((uint32_t)&p_data_header->ctrl_header, &ctrl_header, sizeof(ctrl_header));
    os_unlock(s);
    if (ctrl_header.image_id != img_id)
    {
        ret = DFU_ARV_FAIL_OPERATION;
        return ret;
    }

    uint32_t remain_size = ctrl_header.payload_len + DEFAULT_HEADER_SIZE;

    if (ota_struct.p_ota_temp_buf_head != NULL)
    {
        buffer_size = ota_struct.buffer_size;
    }
    else
    {
        while (p_copy_buffer == NULL && buffer_size)
        {
            buffer_size >>= size_factor;
            p_copy_buffer = (uint8_t *)malloc(buffer_size);
            size_factor ++;
        }

        buffer_addr = p_copy_buffer;
    }

    if (buffer_addr == NULL)
    {
        ret = DFU_ARV_FAIL_OPERATION;
        return ret;
    }

