rtkconnectivity/zephyr/soc/arm/realtek_bee/rtl87x2g/ota_src/ble_dfu_transport.c
    s = os_lock();
    fmc_flash_nor_get_bp_lv(FMC_MAIN0_ADDR, &bp_lv);  //use dest addr is more actually
    os_unlock(s);

    uint32_t copy_len;
    while (remain_size > 0)
    {
        copy_len = (remain_size > buffer_size) ? buffer_size : remain_size;

        s = os_lock();
        fmc_flash_nor_read(source_base_addr + offset, buffer_addr, copy_len);
        os_unlock(s);
        if (dfu_write_data_to_flash(img_id, offset, 0, copy_len, buffer_addr) != 0) //check grace
        {
            ret = DFU_ARV_FAIL_FLASH_WRITE_ERROR;
            return ret;
        }
        remain_size -= copy_len;
        offset += copy_len;
    }

    if (dfu_checksum((IMG_ID)img_id, 0) == false)
    {
        ret = DFU_ARV_FAIL_CRC_ERROR;
    }

    if (p_copy_buffer != NULL)
    {
        free(p_copy_buffer);
    }

    s = os_lock();
    fmc_flash_nor_set_bp_lv(FMC_MAIN0_ADDR, bp_lv);
    os_unlock(s);

    LOG_INF("ble_dfu_cp_copy_img_handle: ret=%d image_id=0x%x", ret, img_id);

    return ret;
}

/**
    * @brief    compare sha256 or crc value with the image in dest addr
    * @param    p_dest    address of the image
    * @param    p_data    sha256 or crc value receive from controler
    * @param    img_id    image id
    * @return   true: same  false: different
    */
static bool ble_dfu_cmp_checksum(uint8_t *p_dest, uint8_t *p_data, IMG_ID img_id)
{
    uint8_t buffer[SHA256_LEN];
    uint32_t offset = SHA256_OFFSET;
    uint32_t len = SHA256_LEN;
    uint32_t s;

    if (img_id >= IMG_DFU_MAX || img_id < IMG_DFU_FIRST)
    {
        return false;
    }

    s = os_lock();
    fmc_flash_nor_read((uint32_t)(p_dest + offset), buffer, len);
    os_unlock(s);

    return (memcmp(p_data, buffer, len) == 0);
}

/**
    * @brief    To check if the image in device is same with image needed to update
    * @param    p_data    point of input data
    * @param    data    point of output data
    * @return   void
    */
static void ble_dfu_cp_check_sha256_handle(uint8_t *p_data, uint8_t *p_notify_data) //0x0f
{
    T_IMG_HEADER_FORMAT *img_addr[2];
    uint16_t num = *(uint16_t *)p_data;
    uint8_t buffer[DFU_NOTIFY_LEN_CHECK_SHA256] = {0};

    if (p_notify_data == NULL)
    {
        return;
    }

    SHA256_CHECK *p_src = (SHA256_CHECK *)(p_data + 2);
    LOG_INF("===>ble_dfu_cp_check_sha256_handle: img_id=0x%x", p_src->img_id);

    if (p_src->img_id >= IMG_DFU_MAX || p_src->img_id < IMG_DFU_FIRST)
    {
        return;
    }

    for (uint16_t i = 0; i < num; i++)
    {
        memset(buffer, 0, sizeof(buffer));
        *(uint16_t *)buffer = p_src->img_id;

        img_addr[0] = (T_IMG_HEADER_FORMAT *)dfu_get_temp_ota_bank_img_addr_by_img_id(p_src->img_id);
        img_addr[1] = (T_IMG_HEADER_FORMAT *)get_header_addr_by_img_id(p_src->img_id);

        for (uint8_t j = 0; j < 2; j++)
        {
            if (img_addr[j] && img_addr[j]->ctrl_header.image_id == p_src->img_id
                && ble_dfu_cmp_checksum((uint8_t *)img_addr[j], p_src->sha256, p_src->img_id))
            {
                buffer[2] += (j + 1);
            }
        }
        LOG_INF("<===ble_dfu_cp_check_sha256_handle: img_id=0x%x, check resut=%x",
                         *(uint16_t *)buffer, buffer[2]);

        memcpy(p_notify_data, buffer, sizeof(buffer));
        p_notify_data += sizeof(buffer);
        p_src++;
    }
}

/**
    * @brief    Handle written request on DFU packet
    * @param    p_data     data to be written
    * @param    length     Length of value to be written
    * @return   handle result  0x01:success other:fail
    */
static uint8_t ble_dfu_packet_handle(uint8_t *p_data, uint16_t length)
{
    uint8_t results = DFU_ARV_SUCCESS;

    LOG_INF("===>ble_dfu_packet_handle: length=%d, nCurOffSet=%d, buffer_check_offset=%d, nImageTotalLength=%d",
                     length, ota_struct.cur_offset, ota_struct.buffer_check_offset, ota_struct.image_total_length);

    ota_struct.ota_flag.skip_flag = 1;

    if ((p_data == NULL) || (ota_struct.ota_flag.is_ota_process == false))
    {
        results = DFU_ARV_FAIL_OPERATION;
        return results;
    }

    if (ota_struct.cur_offset + length + ota_struct.ota_temp_buf_used_size >
        ota_struct.image_total_length)
    {
        results = DFU_ARV_FAIL_INVALID_PARAMETER;
    }
    else
    {
        if (!ota_struct.ota_flag.buffer_check_en)
        {
            if (dfu_get_enc_setting())
            {
                uint16_t offset = 0;
                while ((length - offset) >= 16)
                {
                    dfu_aes256_decrypt_16byte(p_data + offset);
                    offset += 16;
                }
            }

            if (dfu_write_data_to_flash(ota_struct.image_id,
                                        ota_struct.cur_offset,
                                        ota_struct.next_subimage_offset,
                                        length,
                                        p_data) != 0)
            {
                results = DFU_ARV_FAIL_OPERATION;
            }
            else
            {
                ota_struct.cur_offset += length;
            }
        }
        else
        {
            LOG_INF("===>ble_dfu_packet_handle: bufcheck Enable! ota_temp_buf_used_size=0x%x, buffer_size=0x%x",
                             ota_struct.ota_temp_buf_used_size, ota_struct.buffer_size);
            if (ota_struct.ota_temp_buf_used_size + ota_struct.buffer_check_offset + length <=
                ota_struct.buffer_size)
            {
                memcpy(ota_struct.p_ota_temp_buf_head + ota_struct.buffer_check_offset +
                       ota_struct.ota_temp_buf_used_size, p_data, length);
                ota_struct.ota_temp_buf_used_size += length;
            }
            else
            {
                results = DFU_ARV_FAIL_OPERATION;
            }
        }
    }

    return results;
}

/*============================================================================*
 *                              Public Functions
 *============================================================================*/
/**
    * @brief    Used to get device information
    * @param    p_data    point of device info data
    * @param    ota_mode  spp ota or ble ota
    * @return   void
    */
void ble_dfu_get_device_info(struct bt_conn *conn, DEVICE_INFO *p_deviceinfo)
{
    if (p_deviceinfo == NULL)
    {
        return;
    }

    memset(p_deviceinfo, 0, sizeof(DEVICE_INFO));
    p_deviceinfo->ic_type = dfu_get_ic_type();
    p_deviceinfo->spec_ver = BLE_OTA_VERSION;

    p_deviceinfo->mode.buffercheck_en = 1; //ota_struct.test.t_buffercheck_disable ? 0 : 1;
    p_deviceinfo->mode.aes_en = dfu_get_enc_setting();
    p_deviceinfo->mode.aes_mode = 1;
    p_deviceinfo->mode.support_multiimage = 1;
    p_deviceinfo->mode.is_support_normal_ota = SUPPORT_NORMAL_OTA;  //means support normal ota
    p_deviceinfo->mode.is_ota_support_dual_bank_merge = is_ota_support_dual_bank_merge();
    p_deviceinfo->ota_temp_size = flash_partition_size_get(PARTITION_FLASH_OTA_TMP) /
                                  FLASH_SECTOR_SIZE; //uint 4KB
    p_deviceinfo->active_banknum = ble_ota_service_get_active_bank();
    p_deviceinfo->bootpatch_active_banknum = ble_ota_service_get_bootpatch_active_bank();
    p_deviceinfo->secureapp_active_banknum = ble_ota_service_get_secureapp_active_bank();
    p_deviceinfo->ctrl_header_offset = MEMBER_OFFSET(T_IMG_HEADER_FORMAT, ctrl_header);
    
