rtkconnectivity/zephyr/soc/arm/realtek_bee/rtl87x2g/ota_src/ble_dfu_transport.c
    // le_get_conn_param(GAP_PARAM_CONN_MTU_SIZE, &ota_struct.mtu_size, conn);//RTK UPPERSTACK VERSION
    ota_struct.mtu_size = bt_gatt_get_mtu(conn);//ZEPHYR host VERSION

    ota_struct.ota_flag.is_devinfo = 1;
    ota_struct.ota_flag.is_support_mutil_image = p_deviceinfo->mode.support_multiimage;

    uint32_t s;
    s = os_lock();
    fmc_flash_nor_get_bp_lv(FMC_MAIN0_ADDR, &ota_struct.bp_level);
    os_unlock(s);
    LOG_INF("<===ble_dfu_get_device_info: aes_en=%d,bufcheck_en=%d, active_banknum(OTA BANK%d,BOOTPATCH%d,SECUREAPP%d)",
                    p_deviceinfo->mode.aes_en, p_deviceinfo->mode.buffercheck_en,
                    p_deviceinfo->active_banknum, p_deviceinfo->bootpatch_active_banknum,
                    p_deviceinfo->secureapp_active_banknum);
    LOG_INF("p_deviceinfo->mode.is_ota_support_dual_bank_merge %d",
                    p_deviceinfo->mode.is_ota_support_dual_bank_merge);
    LOG_INF("<===ble_dfu_get_device_info: ota_temp_size=%d,mtu_size=%d,bp_lv=%d",
                    p_deviceinfo->ota_temp_size, ota_struct.mtu_size, ota_struct.bp_level);
}

/**
    * @brief    Used to get image version
    * @param    *p_data   point of image version
    * @param    bank   0:active bank    1:inactive bank
    * @return   void
    */
void ble_dfu_get_img_version(uint8_t *p_data, uint8_t bank)
{
    uint8_t num = 0;
    IMG_ID img_id;
    uint8_t buffer[6] = {0};
    uint8_t *p_temp = p_data + 1;
    uint32_t addr = 0;
    uint32_t size = 0;
    T_IMAGE_VERSION image_version;

    //is_ota_support_bank_switch()
    for (img_id = IMG_DFU_FIRST; img_id < IMG_DFU_MAX; img_id++)
    {
        if (bank == ACTIVE_BANK)
        {
            size = get_active_bank_image_size_by_img_id(img_id);
            get_ota_bank_image_version(true, img_id, (T_IMAGE_VERSION *)&image_version);
        }
        else
        {
            if (is_ota_support_bank_switch())
            {
                size = get_temp_ota_bank_img_size_by_img_id(img_id);
                get_ota_bank_image_version(false, img_id, (T_IMAGE_VERSION *)&image_version);
            }
        }

        if (size == 0 || size == 0xffffffff)
        {
            continue;
        }

        *(uint16_t *)buffer = img_id;
        *(uint32_t *)&buffer[2] = image_version.ver_info.version;

        LOG_INF("img_id:%x",img_id);

        num ++;
        memcpy(p_temp, buffer, sizeof(buffer));
        p_temp += sizeof(buffer);
    }

    for (img_id = IMG_USER_DATA_FIRST; img_id < IMG_USER_DATA_MAX; img_id++)
    {
        dfu_get_user_data_info(img_id, &size, false);

        if (size == 0 || size == 0xffffffff)
        {
            continue;
        }

        dfu_get_user_data_info(img_id, &addr, true);
        fmc_flash_nor_read(addr + offsetof(T_IMG_HEADER_FORMAT, git_ver), &image_version,
                           sizeof(T_IMAGE_VERSION));

        *(uint16_t *)buffer = img_id;
        *(uint32_t *)&buffer[2] = image_version.ver_info.version;

        num ++;
        memcpy(p_temp, buffer, sizeof(buffer));
        p_temp += sizeof(buffer);
    }

    *p_data = num;
    LOG_INF("<===ble_dfu_get_img_version, bank_num:%x img_num:%x", bank, num);
}

/**
    * @brief    Used to get image section size
    * @param    p_data  point of the section size
    * @return   void
    */
void ble_dfu_get_section_size(uint8_t *p_data)
{
    uint8_t num = 0;
    IMG_ID img_id;
    uint8_t buffer[6] = {0};
    uint8_t *p_temp = NULL;
    uint32_t size;
    //cppcheck-suppress ctuPointerArith
    p_temp = p_data + 1;

    for (img_id = IMG_DFU_FIRST; img_id < IMG_DFU_MAX; img_id++)
    {
        size = get_active_bank_image_size_by_img_id(img_id);

        if (size == 0 || size == 0xffffffff)
        {
            continue;
        }

        *(uint16_t *)buffer = img_id;
        *(uint32_t *)&buffer[2] = size;

        num ++;
        memcpy(p_temp, buffer, sizeof(buffer));
        p_temp += sizeof(buffer);
    }

    for (img_id = IMG_USER_DATA_FIRST; img_id < IMG_USER_DATA_MAX; img_id++)
    {
        dfu_get_user_data_info(img_id, &size, false);

        if (size == 0 || size == 0xffffffff)
        {
            continue;
        }

        *(uint16_t *)buffer = img_id;
        *(uint32_t *)&buffer[2] = size;

        num ++;
        memcpy(p_temp, buffer, sizeof(buffer));
        p_temp += sizeof(buffer);
    }

    *p_data = num;

    LOG_INF("<===ble_dfu_get_section_size, img_num:%x in active bank", num);
}

void dfu_notify_conn_para_update_req(struct bt_conn *conn, uint8_t error_code)
{
    if (ota_struct.dfu_conn_para_update_in_progress == true)
    {
        uint8_t notif_data[DFU_NOTIFY_LEN_CONN_PARA_UPDATE_REQ] = {0};
        ota_struct.dfu_conn_para_update_in_progress = false;

        notif_data[0] = error_code;
        LOG_INF("<==dfu_notify_conn_para_update_req error_code=0x%x", error_code);
        if (error_code == DFU_ARV_SUCCESS)
        {
            uint16_t conn_interval;
            uint16_t conn_slave_latency;
            uint16_t conn_supervision_timeout;
            struct bt_conn_info info;
            int err;

            err = bt_conn_get_info(conn, &info);
            if (err != 0) {
                LOG_INF("Failed to get conn info: %d", err);
                return;
            }

            conn_interval = info.le.interval;
            conn_slave_latency = info.le.latency;
            conn_supervision_timeout = info.le.timeout;

            LE_UINT16_TO_ARRAY(notif_data + 1, conn_interval);
            LE_UINT16_TO_ARRAY(notif_data + 3, conn_slave_latency);
            LE_UINT16_TO_ARRAY(notif_data + 5, conn_supervision_timeout);
        }
        ble_dfu_service_prepare_send_notify(conn, DFU_OPCODE_CONN_PARA_UPDATE_REQ,
                                            DFU_NOTIFY_LEN_CONN_PARA_UPDATE_REQ,
                                            notif_data);
    }
}


/**
    * @brief    Handle written request on DFU control point characteristic
    * @param    conn     ID to identify the connection
    * @param    length      Length of value to be written
    * @param    p_value     Value to be written
    * @return   T_APP_RESULT
    * @retval   Handle result of this request
    */
T_APP_RESULT ble_dfu_service_handle_cp_req(struct bt_conn *conn, uint16_t length, uint8_t *p_value)
{
    T_APP_RESULT cause = APP_RESULT_INVALID_PDU;
    uint8_t results = DFU_ARV_SUCCESS;
    uint8_t opcode = *p_value;
    uint8_t *p = p_value + 1;
    bool error_flag = false;

