rtkconnectivity/zephyr/soc/arm/realtek_bee/rtl87x2g/ota_src/ble_dfu_transport.c
    T_DFU_CALLBACK_DATA callback_data;
    //callback_data.conn_id = conn->id;
    callback_data.msg_type = SERVICE_CALLBACK_TYPE_WRITE_CHAR_VALUE;
    callback_data.msg_data.write.write_attrib_index = INDEX_DFU_CHAR_DFU_CONTROL_POINT_INDEX;

    printk("===>ble_dfu_service_handle_cp_req: opcode=0x%x, length=%d\n", opcode, length);

    if (opcode > DFU_OPCODE_MIN && opcode <= DFU_OPCODE_TEST_EN
        && ota_struct.ota_flag.is_ota_process)
    {
       // os_timer_create(&ota_struct.timer_handle_ota_transfer, "ota_dimage_transfer",
          //              TIMER_ID_DFU_IMAGE_TRANS, 30 * 1000, false, ble_dfu_timeout_cb);
        //printk("&ota_struct.timer_handle_ota_transfer:%x",&ota_struct.timer_handle_ota_transfer);
        //os_timer_start(&ota_struct.timer_handle_ota_transfer);
    }

    switch (opcode)
    {
    case DFU_OPCODE_START_DFU:
        {
            if (length == DFU_LENGTH_CP_START_DFU)   /* 4 bytes is pending for encrypt */
            {
                LOG_HEXDUMP_INF(p_value, length, "===>ble_dfu_service_handle_cp_req: start dfu data:");
                cause = APP_RESULT_SUCCESS;
                results = ble_dfu_cp_start_dfu_handle(p);
                
                uint32_t callback_data_value[2];
                callback_data_value[0] = ota_struct.image_id;
                callback_data_value[1] = ota_struct.image_total_length;

                callback_data.msg_data.write.opcode = DFU_WRITE_START;
                callback_data.msg_type = SERVICE_CALLBACK_TYPE_WRITE_CHAR_VALUE;
                callback_data.msg_data.write.p_value = (uint8_t *)&callback_data_value;

                cause = app_dfu_srv_cb((void *)&callback_data);
               
                ble_dfu_service_prepare_send_notify(conn, DFU_OPCODE_START_DFU, sizeof(results), &results);

                LOG_INF("DFU_OPCODE_START_DFU done!");
            }
            else
            {
                error_flag = true;
            }
        }
        break;
    case DFU_OPCODE_RECEIVE_FW_IMAGE_INFO:
        {
            if (length == DFU_LENGTH_CP_RECEIVE_FW_IMAGE_INFO)
            {
                uint16_t image_id;

                LE_ARRAY_TO_UINT16(image_id, p);
                cause = APP_RESULT_SUCCESS;
                if (image_id == ota_struct.image_id)
                {
                    LE_ARRAY_TO_UINT32(ota_struct.cur_offset, p + 2);
                    LOG_INF("===>ble_dfu_service_handle_cp_req: image_id=0x%x, cur_offset=%d",
                                     image_id, ota_struct.cur_offset);
                }
            }
            else
            {
                error_flag = true;
            }
        }
        break;
    case DFU_OPCODE_VALID_FW:
        {
            if (length == DFU_LENGTH_CP_VALID_FW)
            {
                cause = APP_RESULT_SUCCESS;
                results = ble_dfu_cp_valid_handle(p);
                ble_dfu_service_prepare_send_notify(conn, DFU_OPCODE_VALID_FW, sizeof(results), &results);
            }
            else
            {
                error_flag = true;
            }
        }
        break;
    case DFU_OPCODE_ACTIVE_IMAGE_RESET:
        {
            printk("in DFU_OPCODE_ACTIVE_IMAGE_RESET\n");
            if (length == DFU_LENGTH_CP_ACTIVE_IMAGE_RESET)
            {
                bool is_enter_dfu_mode = *p;
                cause = APP_RESULT_SUCCESS;
                ble_dfu_cp_active_reset_handle(conn, is_enter_dfu_mode);
                ota_struct.ota_flag.is_ota_process = false;
                os_timer_stop(&ota_struct.timer_handle_ota_transfer);
                
                callback_data.msg_data.write.opcode = DFU_WRITE_END;
                cause = app_dfu_srv_cb((void *)&callback_data);
                printk("done DFU_OPCODE_ACTIVE_IMAGE_RESET?\n");
            }
            else
            {
                error_flag = true;
            }
        }
        break;
    case DFU_OPCODE_SYSTEM_RESET:
        {
            cause = APP_RESULT_SUCCESS;
            ble_dfu_clear_local(OTA_RESET_CMD);

            T_DFU_FAIL_REASON dfu_fail_reason = DFU_FAIL_SYSTEM_RESET_CMD;
            callback_data.msg_data.write.length = sizeof(T_DFU_FAIL_REASON);
            callback_data.msg_data.write.p_value = (uint8_t *)&dfu_fail_reason;
            callback_data.msg_data.write.opcode = DFU_WRITE_FAIL;

            cause = app_dfu_srv_cb((void *)&callback_data);

            bt_conn_disconnect(conn,BT_HCI_ERR_REMOTE_USER_TERM_CONN);
        }
        break;
    case DFU_OPCODE_REPORT_TARGET_INFO:
        {
            if (length == DFU_LENGTH_CP_REPORT_TARGET_INFO)
            {
                uint8_t notif_data[DFU_NOTIFY_LEN_TARGET_INFO] = {0};

                cause = APP_RESULT_SUCCESS;
                ble_dfu_cp_report_img_info_handle(p, notif_data);
                ble_dfu_service_prepare_send_notify(conn, DFU_OPCODE_REPORT_TARGET_INFO,
                                                    DFU_NOTIFY_LEN_TARGET_INFO,
                                                    notif_data);
            }
            else
            {
                error_flag = true;
            }
        }
        break;
    case DFU_OPCODE_CONN_PARA_UPDATE_REQ:
        {
            if (length == DFU_LENGTH_CP_CONN_PARA_UPDATE_REQ)
            {
                uint8_t notif_data[DFU_NOTIFY_LEN_CONN_PARA_UPDATE_REQ] = {0};

                cause = APP_RESULT_SUCCESS;
                ble_dfu_cp_conn_para_update_handle(conn, p, notif_data);
                if (notif_data[0] != DFU_ARV_SUCCESS)
                {
                    ble_dfu_service_prepare_send_notify(conn, DFU_OPCODE_CONN_PARA_UPDATE_REQ,
                                                        DFU_NOTIFY_LEN_CONN_PARA_UPDATE_REQ,
                                                        notif_data);
                }
            }
            else
            {
                error_flag = true;
            }
        }
        break;
    case DFU_OPCODE_BUFFER_CHECK_EN:
        {
            if (length  == DFU_LENGTH_CP_BUFFER_CHECK_EN)
            {
                uint8_t notif_data[DFU_NOTIFY_LEN_BUFFER_CHECK_EN] = {0};

                cause = APP_RESULT_SUCCESS;
                ble_dfu_cp_buffer_check_en_handle(notif_data, MAX_BUFFER_SIZE);
                ble_dfu_service_prepare_send_notify(conn, DFU_OPCODE_BUFFER_CHECK_EN,
                                                    DFU_NOTIFY_LEN_BUFFER_CHECK_EN,
                                                    notif_data);
            }
            else
            {
                error_flag = true;
            }
        }
        break;
    case DFU_OPCODE_REPORT_BUFFER_CRC:
        {
            if (length  == DFU_LENGTH_CP_REPORT_BUFFER_CRC)
            {
                uint8_t notif_data[DFU_NOTIFY_LEN_BUFFER_CHECK] = {0};

                cause = APP_RESULT_SUCCESS;
                ble_dfu_cp_buffer_check_handle(p, notif_data);
                ble_dfu_service_prepare_send_notify(conn, DFU_OPCODE_REPORT_BUFFER_CRC,
                                                    DFU_NOTIFY_LEN_BUFFER_CHECK,
                                                    notif_data);
            }
            else
            {
                error_flag = true;
            }
        }
        break;
    case DFU_OPCODE_COPY_IMG:
        {
            cause = APP_RESULT_SUCCESS;
            results = ble_dfu_cp_copy_img_handle(p);
            ble_dfu_service_prepare_send_notify(conn, DFU_OPCODE_COPY_IMG, sizeof(results), &results);
        }
        break;
    case DFU_OPCODE_GET_IMAGE_VER:
        {
            uint8_t notif_data[DFU_NOTIFY_LEN_IMG_INFO] = {0};

            cause = APP_RESULT_SUCCESS;
            notif_data[0] = *p; //bank_num, 0: active, 1: inactive
            ble_dfu_get_img_version(&notif_data[1], notif_data[0]);
            ble_dfu_service_prepare_send_notify(conn, DFU_OPCODE_GET_IMAGE_VER,
                                                2 + 6 * notif_data[1]/*DFU_NOTIFY_LEN_IMG_INFO*/, notif_data);
        }
        break;
    case DFU_OPCODE_GET_SECTION_SIZE:
        {
            uint8_t notif_data[DFU_NOTIFY_LEN_SECTION_SIZE] = {0};

            cause = APP_RESULT_SUCCESS;
            ble_dfu_get_section_size(notif_data);
            ble_dfu_service_prepare_send_notify(conn, DFU_OPCODE_GET_SECTION_SIZE,
                                                1 + 6 * notif_data[0]/*DFU_NOTIFY_LEN_SECTION_SIZE*/, notif_data);
        }
        break;
    case DFU_OPCODE_CHECK_SHA256:
        {
            uint8_t notif_data[DFU_NOTIFY_LEN_CHECK_SHA256] = {0};
            uint16_t num = *(uint16_t *)p;
            LOG_INF("ble_dfu_service_handle_cp_req: CHECK SHA2556 num=%d", num);

            cause = APP_RESULT_SUCCESS;
            ble_dfu_cp_check_sha256_handle(p, notif_data);
            ble_dfu_service_prepare_send_notify(conn, DFU_OPCODE_CHECK_SHA256, DFU_NOTIFY_LEN_CHECK_SHA256,
                                                notif_data); //check grace, send all img sha256 or not?
        }
        break;
    case DFU_OPCODE_GET_RELEASE_VER:
        {
            uint8_t notif_data[DFU_NOTIFY_LEN_RELEASE_VER] = {0};
            uint32_t p_imgheader = get_header_addr_by_img_id(IMG_MCUAPP);

            cause = APP_RESULT_SUCCESS;
            memcpy(notif_data, (uint8_t *)(p_imgheader + RELEASE_VER_OFFSET), DFU_NOTIFY_LEN_RELEASE_VER);
            ble_dfu_service_prepare_send_notify(conn, DFU_OPCODE_GET_RELEASE_VER, DFU_NOTIFY_LEN_RELEASE_VER,
                                                notif_data);
        }
        break;
    case DFU_OPCODE_TEST_EN:
        {
            cause = APP_RESULT_SUCCESS;
            memcpy(&ota_struct.test.value, p, sizeof(ota_struct.test.value));
        }
        break;
    case DFU_OPCODE_REPORT_IMAGE_NUM:
        {
            uint16_t image_id;
            uint8_t cur_num;
            uint8_t total_num;

            LE_ARRAY_TO_UINT16(image_id, p);
            cur_num = *(p + 2);
            total_num = *(p + 3);
            LOG_INF("ble_dfu_service_handle_cp_req: REPORT IMAGE NUM image_id = 0x%x, cur_num = %d, total_num = %d",
                             image_id, cur_num, total_num);

            cause = APP_RESULT_SUCCESS;
        }
        break;
    default:
        LOG_ERR("ble_dfu_service_handle_cp_req, opcode %d not expected", opcode);
        break;
    }

    if (error_flag)
    {
        LOG_ERR("ble_dfu_service_handle_cp_req: invalid length");
    }

    return cause;
}

/**
    * @brief    Handle written request on DFU packet characteristic
    * @param    conn     ID to identify the connection
    * @param    length      Length of value to be written
    * @param    p_value     Value to be written
    * @return   T_APP_RESULT
    * @retval   Handle result of this request
    */
T_APP_RESULT ble_dfu_service_handle_packet(struct bt_conn *conn, uint16_t length, uint8_t *p_value)
{
    uint8_t result;

    result = ble_dfu_packet_handle(p_value, length);

    if (result == DFU_ARV_FAIL_INVALID_PARAMETER)
    {
        return APP_RESULT_INVALID_PDU;
    }
    else if (result == DFU_ARV_FAIL_OPERATION)
    {
        return APP_RESULT_APP_ERR;
    }

    return APP_RESULT_SUCCESS;
}

